In [2]:
import pandas as pd

df = pd.read_csv("btc_oyv.csv")

df.head()

         time    open    high     low   close  volumefrom    volumeto
0  2014-07-01  635.14  652.54  634.09  643.19     4106.32  2675353.96
1  2014-07-02  643.19  652.10  604.58  645.72     4784.21  3099761.96
2  2014-07-03  645.72  646.40  633.58  638.03     4010.26  2580980.48
3  2014-07-04  638.03  642.22  623.04  623.96     3601.75  2291612.17
4  2014-07-05  623.96  627.80  619.69  622.96     3247.38  2034965.63

In [3]:
df.tail()

,time,open,high,low,close,volumefrom,volumeto
3997,2025-06-09,105779.28,110543.89,105372.62,110302.12,17851.91,1.927021e+09
3998,2025-06-10,110302.12,110403.60,108373.44,110296.20,15646.83,1.712252e+09
3999,2025-06-11,110296.20,110425.64,108096.82,108676.78,14497.20,1.585493e+09
4000,2025-06-12,108676.78,108843.81,105721.73,105726.04,18051.35,1.937274e+09
4001,2025-06-13,105726.04,105740.35,102773.14,105085.88,16485.68,1.718550e+09

In [4]:
df.columns = ['Date', "Open Price", "High", "Low", "Close Price", "Volume From", "Volume To"]

In [5]:
df

,Date,Open Price,High,Low,Close Price,Volume From,Volume To
0,2014-07-01,635.14,652.54,634.09,643.19,4106.32,2.675354e+06
1,2014-07-02,643.19,652.10,604.58,645.72,4784.21,3.099762e+06
2,2014-07-03,645.72,646.40,633.58,638.03,4010.26,2.580980e+06
3,2014-07-04,638.03,642.22,623.04,623.96,3601.75,2.291612e+06
4,2014-07-05,623.96,627.80,619.69,622.96,3247.38,2.034966e+06
...,...,...,...,...,...,...,...
3997,2025-06-09,105779.28,110543.89,105372.62,110302.12,17851.91,1.927021e+09
3998,2025-06-10,110302.12,110403.60,108373.44,110296.20,15646.83,1.712252e+09
3999,2025-06-11,110296.20,110425.64,108096.82,108676.78,14497.20,1.585493e+09
4000,2025-06-12,108676.78,108843.81,105721.73,105726.04,18051.35,1.937274e+09
4001,2025-06-13,105726.04,105740.35,102773.14,105085.88,16485.68,1.718550e+09

In [6]:
df.shape

(4002, 7)

In [11]:
df.isnull().sum()
df.duplicated().sum()
df = df.drop_duplicates()

In [12]:
df.duplicated().sum()

0

In [23]:
print(df.columns.tolist())
df.drop("Volume To", axis=1)

['Date', 'Open Price', 'High', 'Low', 'Close Price', 'Volume To']

            Date  Open Price       High        Low  Close Price
0     2014-07-01      635.14     652.54     634.09       643.19
1     2014-07-02      643.19     652.10     604.58       645.72
2     2014-07-03      645.72     646.40     633.58       638.03
3     2014-07-04      638.03     642.22     623.04       623.96
4     2014-07-05      623.96     627.80     619.69       622.96
...          ...         ...        ...        ...          ...
3997  2025-06-09   105779.28  110543.89  105372.62    110302.12
3998  2025-06-10   110302.12  110403.60  108373.44    110296.20
3999  2025-06-11   110296.20  110425.64  108096.82    108676.78
4000  2025-06-12   108676.78  108843.81  105721.73    105726.04
4001  2025-06-13   105726.04  105740.35  102773.14    105085.88

[4001 rows x 5 columns]

In [24]:
df = df[['Date', 'Open Price', 'Close Price', 'High', 'Low']]

In [26]:
print(df.columns.tolist())

['Date', 'Open Price', 'Close Price', 'High', 'Low']

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4001 entries, 0 to 4001
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Date         4001 non-null   object
 1   Open Price   4001 non-null   float64
 2   Close Price  4001 non-null   float64
 3   High         4001 non-null   float64
 4   Low          4001 non-null   float64
dtypes: float64(4), object(1)
memory usage: 316.6+ KB

In [28]:
df.isnull().sum()

Date           0
Open Price     0
Close Price    0
High           0
Low            0
dtype: int64

In [29]:
df.duplicated().sum()

0

In [30]:
df.dtypes

Date            object
Open Price     float64
Close Price    float64
High           float64
Low            float64
dtype: object

In [33]:
df.describe()

,Date,Open Price,Close Price,High,Low
count,4001,4001.000000,4001.000000,4001.00000,4001.000000
mean,2019-12-22 00:00:00.000000256,22275.601685,22301.702959,22784.72905,21736.906368
min,2014-07-01 00:00:00,164.920000,164.920000,212.59000,157.290000
25%,2017-03-27 00:00:00,1179.220000,1180.780000,1206.97000,1150.290000
50%,2019-12-22 00:00:00,9610.110000,9611.420000,9805.42000,9340.450000
75%,2022-09-17 00:00:00,35932.790000,36009.890000,37429.24000,34733.760000
max,2025-06-13 00:00:00,111722.110000,111722.110000,111998.96000,109250.400000
std,NaN,26362.798174,26393.066227,26901.75670,25797.139868

In [35]:
(df['Low'] > df['High']).sum()

0

In [38]:
df.loc[:, 'Date'] = pd.to_datetime(df['Date'])

In [40]:
df.dtypes

Date           datetime64[ns]
Open Price            float64
Close Price           float64
High                  float64
Low                   float64
dtype: object

In [43]:
df.to_csv("btc_oyv.csv", index=False)

In [44]:
df.duplicated().sum()

0